APPLY() - CALCULATE PROJECT SALARY NEXT YEAR

In [29]:
# Importing librairies
import matplotlib.pyplot as plt
import pandas as pd
from datasets import load_dataset

# Loading data
dataset = load_dataset('lukebarousse/data_jobs')
df = pd.DataFrame(dataset['train'])

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [30]:
df_salary = df[pd.notna(df['salary_year_avg'])].reset_index()
df_cop=df_salary.copy()

In [31]:
def projected_salary(salary):
    return salary*1.3
df_salary['salary_year_inflated']=df_salary['salary_year_avg'].apply(projected_salary)

In [32]:
# We can also do it by using an anonymous or lambda function
df_salary['salary_year_inflated'] = df_salary['salary_year_avg'].apply(lambda salary: salary*1.3)

In [33]:
#   Performing a cleaning in the job_skills column on df
import ast
def clean_job(skills):
    if pd.notna(skills):
        return ast.literal_eval(skills)
df['job_skills'] = df['job_skills'].apply(clean_job)

In [34]:
# Checking
df['job_skills']

0                                                      None
1                [r, python, sql, nosql, power bi, tableau]
2         [python, sql, c#, azure, airflow, dax, docker,...
3         [python, c++, java, matlab, aws, tensorflow, k...
4         [bash, python, oracle, aws, ansible, puppet, j...
                                ...
785736    [bash, python, perl, linux, unix, kubernetes, ...
785737                               [sas, sas, sql, excel]
785738                                  [powerpoint, excel]
785739    [python, go, nosql, sql, mongo, shell, mysql, ...
785740                                          [aws, flow]
Name: job_skills, Length: 785741, dtype: object

In [35]:
# We can also do it by using a lambda function
df_cop['job_skills'] = df_cop['job_skills'].apply(lambda skill: ast.literal_eval(skill) if pd.notna(skill) else skill)

In [36]:
# Checking
df_cop['job_skills']

0                                            [gdpr, excel]
1        [mongodb, mongodb, python, r, sql, mysql, mari...
2                                            [sql, python]
3                                [sql, r, python, express]
4                            [python, r, alteryx, tableau]
                               ...
21998    [go, python, r, sql, oracle, windows, alteryx,...
21999                                                 None
22000                    [python, azure, snowflake, spark]
22001         [python, hadoop, spark, airflow, kubernetes]
22002                                  [python, matlab, r]
Name: job_skills, Length: 22003, dtype: object

In [37]:
# We are gonna test the apply() method on rows now using the df_salary method
df_salary['salary_year_avg'] = df_salary.apply( lambda row : 1.5 * row['salary_year_avg'] if 'Senior' in row['job_title_short'] else 1.5 * row['salary_year_avg'], axis=1 )
df_salary[['job_title_short', 'salary_year_avg']]

      job_title_short  salary_year_avg
0      Data Scientist         164250.0
1       Data Engineer         210000.0
2       Data Engineer         180000.0
3      Data Scientist         342333.0
4        Data Analyst         133500.0
...               ...              ...
21998   Data Engineer         208824.0
21999   Data Engineer         225000.0
22000  Data Scientist         332812.5
22001  Data Scientist         236250.0
22002  Data Scientist         236250.0

[22003 rows x 2 columns]